app/controllers/api/v1/urls_controller.rb

SELECT "urls".* FROM "urls"
---
      def index
        @urls = Url.all.collect{|a| [a.main_url,a.shortener_url]}