app/controllers/urls_controller.rb

  def index
   @urls = Url.all
---
SELECT "urls".* FROM "urls"

  def create
    if !params[:url].blank? and user_signed_in?
      client = Bitly.client
      @url = client.shorten(params[:url])
      Url.create(main_url: @url.long_url ,shortener_url: @url.short_url) if @url
---
INSERT INTO "urls" ("main_url", "shortener_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["main_url", "https://github.com/abhikumar90/url_shortener"], ["shortener_url", "http://bit.ly/2qtGAI6"], ["created_at", "2018-04-14 07:55:09.908586"], ["updated_at", "2018-04-14 07:55:09.908586"]]