app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    authorize @user
    if @user.update_attributes(secure_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 2], ["updated_at", "2018-01-22 20:03:52.654275"], ["id", 1]]

  def destroy
    user = User.find(params[:id])
    authorize user
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]